'''
- 1. Трансляція: у чому головна відмінність між роботою
компілятора та інтерпретатора? До якого типу трансляції належить Python і чому?

Відповідь:
Кампілятор перекладає всю програму в машиний код перед її виконанням.
Інтерпретатор виконує програму під час її запуску, обробляючи через середовище виконання.

Python зазвичай відносять до інтерпретованих мов. Код Python спочатку перетворюється
у байт-код, після чого виконується віртуальною машиною Python.



- 2. Типізація: поясніть різницю між статичною та динамічною типізацією.
Наведіть по одному прикладу мов для кожного типу.

Відповідь:
Статична типізація — тип змінної визначається та перевіряється до виконання програми.

Динамічна типізація — тип визначається під час виконання програми, і одна змінна
може посилатися на значення різних типів.

- 3. Сильна та слабка типізація: чому Python вважається мовою зі сильною типізацією?
Що станеться у Python при спробі виконати операцію "10" + 5 і чому?

Відповідь:
Сильна та слабка типізація — це характеристика мов програмування, яка визначає,
як суворо мова контролює відповідність типів даних під час операцій та чи допускає
неявне (автоматичне) їх перетворення.

Python має сильну типізацію, тому він не виконує автоматично небезпечне перетворення
несумісних типів.
'''

num_1 = 5
num_2 ="6"

# print(num_1 + num_2)

print(num_1 + int(num_2))

